rite a R program to create a data frame from four given vectors

In [21]:
name <- c("John", "Mary", "Peter")
age <- c(25, 30, 35)
hight <- c(1.75, 1.60, 1.80)
weight <- c(75, 50, 80)

# Create a data frame
df <- data.frame(name, age, hight, weight)

df
class(df)

  name  age hight weight
1 John  25  1.75  75
2 Mary  30  1.60  50
3 Peter 35  1.80  80

[1] "data.frame"

In [ ]:
# Display the structure of the data frame 'exam_data'
print(str(df))

'data.frame':	3 obs. of  4 variables:
 $ name  : Factor w/ 3 levels "John","Mary",..: 1 2 3
 $ age   : num  25 30 35
 $ hight : num  1.75 1.6 1.8
 $ weight: num  75 50 80
NULL

In [ ]:
#summary of the dataframe
summary.data.frame(df)

    name        age           hight           weight
 John :1   Min.   :25.0   Min.   :1.600   Min.   :50.00
 Mary :1   1st Qu.:27.5   1st Qu.:1.675   1st Qu.:62.50
 Peter:1   Median :30.0   Median :1.750   Median :75.00
           Mean   :30.0   Mean   :1.717   Mean   :68.33
           3rd Qu.:32.5   3rd Qu.:1.775   3rd Qu.:77.50
           Max.   :35.0   Max.   :1.800   Max.   :80.00

In [ ]:
summary(df)

    name        age           hight           weight
 John :1   Min.   :25.0   Min.   :1.600   Min.   :50.00
 Mary :1   1st Qu.:27.5   1st Qu.:1.675   1st Qu.:62.50
 Peter:1   Median :30.0   Median :1.750   Median :75.00
           Mean   :30.0   Mean   :1.717   Mean   :68.33
           3rd Qu.:32.5   3rd Qu.:1.775   3rd Qu.:77.50
           Max.   :35.0   Max.   :1.800   Max.   :80.00

In [ ]:
# Extract specific columns using column names
result <- df[, c("name", "age")]

In [ ]:
result

  name  age
1 John  25
2 Mary  30
3 Peter 35

In [ ]:
# Extract the first two rows
first_two_raw <- df[1:2,] 
first_two_raw

  name age hight weight
1 John 25  1.75  75
2 Mary 30  1.60  50

In [ ]:
# Extract 2nd and 3rd rows with 1st and 3rd columns
raw <- df[c(2, 3), c(1, 3)]
df
raw

  name  age hight weight
1 John  25  1.75  75
2 Mary  30  1.60  50
3 Peter 35  1.80  80

  name  hight
2 Mary  1.6
3 Peter 1.8

In [ ]:
# ad new column using cbind()
df <- cbind(df, department = c("HR", "IT", "Finance"))
df

  name  age hight weight salary department
1 John  25  1.75  75     50000  HR
2 Mary  30  1.60  50     60000  IT
3 Peter 35  1.80  80     75000  Finance

In [23]:
#Alternative method: Add a new column 'salary'
df$salary <- c(50000, 60000, 75000)
df
class(df)

  name  age hight weight salary
1 John  25  1.75  75     50000
2 Mary  30  1.60  50     60000
3 Peter 35  1.80  80     75000

[1] "data.frame"

In [31]:
df

  name  weight salary
1 John  75     50000
2 Mary  50     60000
3 Peter 80     75000

In [32]:
# Add multiple rows using rbind()
new_rows <- data.frame(
  name = c("Eve", "Frank"),
  weight = c(150, 180),
  salary = c(50000, 60000)
 
)
df <- rbind(df, new_rows)

In [33]:
df
class(df)

  name  weight salary
1 John   75    50000
2 Mary   50    60000
3 Peter  80    75000
4 Eve   150    50000
5 Frank 180    60000

[1] "data.frame"

In [34]:
df<- df[, !colnames(df) %in% c("weight")]
df

  name  salary
1 John  50000
2 Mary  60000
3 Peter 75000
4 Eve   50000
5 Frank 60000